Revit 2026 API

# BoundingBoxXYZBounds Property

---

Indexed access for loops. Use 0 for Min and 1 for Max.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ this[
	int bound
] { get; set; }
```
```vb
Public Property Bounds (
	bound As Integer
) As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Bounds[int bound] {
	XYZ^ get (int bound);
	void set (int bound, XYZ^ value);
}
```
```fsharp
member Bounds : XYZ with get, set
```

#### Parameters

bound Int32

#### Property Value

XYZ

The bounds are defined in the coordinate space of the box.

#### Reference

BoundingBoxXYZ Class

Autodesk.Revit.DB Namespace